src/toir_cf/src/Documents/торо_ПлановаяДоступностьПерсонала/торо_ПлановаяДоступностьПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ПлановаяДоступностьПерсонала</name>
  <registerRecords>InformationRegister.торо_СостояниеРаботыСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РабочееВремяСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаГрафика</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <comment>В секундах</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСотрудника</name>
      <type>
        <types>CatalogRef.торо_СостоянияСотрудника</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cf/src/InformationRegisters/торо_СостояниеРаботыСотрудников/торо_СостояниеРаботыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СостояниеРаботыСотрудников</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВремяРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СостояниеСотрудника</name>
    <type>
      <types>CatalogRef.торо_СостоянияСотрудника</types>
    </type>
  </resources>
  <resources>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаГрафика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПериода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/Documents/торо_ПлановаяДоступностьПерсонала/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОкончаниеПланирования = НачалоМесяца(ТекущаяДатаСеанса()) - 1;
	НачалоПланирования    = НачалоМесяца(ОкончаниеПланирования);
	
	торо_ЗаполнениеДокументов.ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// проверка на состояния сотрудника
	ПроверитьСостоянияСотрудников(Отказ);
	
	// проверить суммарное время сотрудника
	ПроверитьСуммарноеВремяРаботыСотрудников(Отказ);
	
	// проверка на пересечение периодов
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДвиженияПоРегистру_торо_СостояниеРаботыСотрудников(Отказ, РежимПроведения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтоНовый() Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияПоРегистру_торо_СостояниеРаботыСотрудников(Отказ, Режим)
	
	тзРабочееВремя = РабочееВремяСотрудников.Выгрузить();
	тзРабочееВремя.Сортировать("Сотрудник,ДатаГрафика,ВремяНачала");
	
	ТекСотрудник = Неопределено; ТекДатаГрафика = Неопределено;
	НомерПериода = 1;
	
	Для каждого СтрокаТЗ Из тзРабочееВремя Цикл
	
		Если ТекСотрудник <> СтрокаТЗ.Сотрудник ИЛИ ТекДатаГрафика <> СтрокаТЗ.ДатаГрафика Тогда
			ТекСотрудник = СтрокаТЗ.Сотрудник;
			ТекДатаГрафика = СтрокаТЗ.ДатаГрафика;
			НомерПериода = 1;
		КонецЕсли;
		//-----------------------------------
		Движение = Движения.торо_СостояниеРаботыСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТЗ);
		Движение.Организация    = Организация;
		Движение.Подразделение  = Подразделение;
		Движение.Период         = Дата;
		Движение.НомерПериода   = НомерПериода;
		Движение.ВремяНачала    = СоединитьДатуИВремя(СтрокаТЗ.ДатаГрафика, СтрокаТЗ.ВремяНачала);
		Движение.ВремяОкончания = СоединитьДатуИВремя(СтрокаТЗ.ДатаГрафика, СтрокаТЗ.ВремяОкончания);
		//-----------------------------------
		НомерПериода = НомерПериода + 1;
	
	КонецЦикла;
	
	ДобавитьОтмененныеПериоды(тзРабочееВремя);
	
	Движения.торо_СостояниеРаботыСотрудников.Записать(Истина);

КонецПроцедуры

Функция СоединитьДатуИВремя(Знач лДата, Знач лВремя)

	лДатаВремя = лВремя - НачалоДня(лВремя);
	Возврат НачалоДня(лДата) + лДатаВремя;

КонецФункции // СоединитьДатуИВремя()

Процедура ДобавитьОтмененныеПериоды(табРабочееВремяСотрудников)
	
	#Область ТекстЗапроса
	ТекстЗапроса = "ВЫБРАТЬ
	               |	табРабочееВремяСотрудников.Сотрудник КАК Сотрудник,
	               |	табРабочееВремяСотрудников.ДатаГрафика КАК ДатаГрафика,
	               |	табРабочееВремяСотрудников.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ВТРабочееВремяСотрудников
	               |ИЗ
	               |	&табРабочееВремяСотрудников КАК табРабочееВремяСотрудников
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТРабочееВремяСотрудников.Сотрудник КАК Сотрудник,
	               |	ВТРабочееВремяСотрудников.ДатаГрафика КАК ДатаГрафика,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТРабочееВремяСотрудников.НомерСтроки) КАК НомерПериода
	               |ПОМЕСТИТЬ ВТМаксПериодСотрудникков
	               |ИЗ
	               |	ВТРабочееВремяСотрудников КАК ВТРабочееВремяСотрудников
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТРабочееВремяСотрудников.Сотрудник,
	               |	ВТРабочееВремяСотрудников.ДатаГрафика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_СостояниеРаботыСотрудниковСрезПоследних.Организация КАК Организация,
	               |	торо_СостояниеРаботыСотрудниковСрезПоследних.Подразделение КАК Подразделение,
	               |	торо_СостояниеРаботыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	               |	торо_СостояниеРаботыСотрудниковСрезПоследних.ДатаГрафика КАК ДатаГрафика,
	               |	торо_СостояниеРаботыСотрудниковСрезПоследних.НомерПериода КАК НомерПериода,
	               |	0 КАК ВремяРаботы,
	               |	торо_СостояниеРаботыСотрудниковСрезПоследних.СостояниеСотрудника КАК СостояниеСотрудника,
	               |	торо_СостояниеРаботыСотрудниковСрезПоследних.ВремяНачала КАК ВремяНачала,
	               |	торо_СостояниеРаботыСотрудниковСрезПоследних.ВремяОкончания КАК ВремяОкончания,
	               |	ИСТИНА КАК Отменен
	               |ИЗ
	               |	ВТМаксПериодСотрудникков КАК ВТМаксПериодСотрудникков
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СостояниеРаботыСотрудников.СрезПоследних(
	               |				&МоментВремени,
	               |				Организация = &Организация
	               |					И Подразделение = &Подразделение) КАК торо_СостояниеРаботыСотрудниковСрезПоследних
	               |		ПО ВТМаксПериодСотрудникков.Сотрудник = торо_СостояниеРаботыСотрудниковСрезПоследних.Сотрудник
	               |			И ВТМаксПериодСотрудникков.ДатаГрафика = торо_СостояниеРаботыСотрудниковСрезПоследних.ДатаГрафика
	               |			И ВТМаксПериодСотрудникков.НомерПериода < торо_СостояниеРаботыСотрудниковСрезПоследних.НомерПериода";
	#КонецОбласти
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МоментВремени", Новый МоментВремени(Дата, Ссылка));
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("табРабочееВремяСотрудников", табРабочееВремяСотрудников);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		Движение = Движения.торо_СостояниеРаботыСотрудников.Добавить();
		Движение.Период = Дата;
		ЗаполнитьЗначенияСвойств(Движение,Выборка);
	
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПроверитьСостоянияСотрудников(Отказ)

	#Область ТекстЗапроса
	ТекстЗапроса = "ВЫБРАТЬ
	               |	табРабочееВремяСотрудников.Сотрудник КАК Сотрудник,
	               |	табРабочееВремяСотрудников.ДатаГрафика КАК ДатаГрафика,
	               |	табРабочееВремяСотрудников.СостояниеСотрудника КАК СостояниеСотрудника,
	               |	табРабочееВремяСотрудников.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ВТРабВремяСотрудников
	               |ИЗ
	               |	&табРабочееВремяСотрудников КАК табРабочееВремяСотрудников
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТРабВремяСотрудников.Сотрудник КАК Сотрудник,
	               |	ВТРабВремяСотрудников.ДатаГрафика КАК ДатаГрафика,
	               |	МАКСИМУМ(ВТРабВремяСотрудников.НомерСтроки) КАК НомерСтроки
	               |ИЗ
	               |	ВТРабВремяСотрудников КАК ВТРабВремяСотрудников
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТРабВремяСотрудников.Сотрудник,
	               |	ВТРабВремяСотрудников.ДатаГрафика
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТРабВремяСотрудников.СостояниеСотрудника) > 1";
	#КонецОбласти 
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("табРабочееВремяСотрудников", РабочееВремяСотрудников);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		ТекстСообщения = СтрШаблон("Для сотрудника %1 на %2 указаны различные состояния (строка %3)", Выборка.Сотрудник, Формат(Выборка.ДатаГрафика,"ДФ=dd.MM.yy") , Выборка.НомерСтроки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,Ссылка,,,Отказ);
	
	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьСуммарноеВремяРаботыСотрудников(Отказ)
	
	#Область ТекстЗапроса
	ТекстЗапроса = "ВЫБРАТЬ
	               |	табРабочееВремяСотрудников.Сотрудник КАК Сотрудник,
	               |	табРабочееВремяСотрудников.ДатаГрафика КАК ДатаГрафика,
	               |	табРабочееВремяСотрудников.ВремяРаботы КАК ВремяРаботы,
	               |	табРабочееВремяСотрудников.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ВТРабВремяСотрудников
	               |ИЗ
	               |	&табРабочееВремяСотрудников КАК табРабочееВремяСотрудников
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТРабВремяСотрудников.Сотрудник КАК Сотрудник,
	               |	ВТРабВремяСотрудников.ДатаГрафика КАК ДатаГрафика,
	               |	МАКСИМУМ(ВТРабВремяСотрудников.НомерСтроки) КАК НомерСтроки
	               |ИЗ
	               |	ВТРабВремяСотрудников КАК ВТРабВремяСотрудников
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТРабВремяСотрудников.Сотрудник,
	               |	ВТРабВремяСотрудников.ДатаГрафика
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ВТРабВремяСотрудников.ВремяРаботы) > &ЛимитВремениРаботы";
	#КонецОбласти 
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("табРабочееВремяСотрудников", РабочееВремяСотрудников);
	Запрос.УстановитьПараметр("ЛимитВремениРаботы", 24*3600);   // 24 часа
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		ТекстСообщения = СтрШаблон("Для сотрудника %1 на %2 суммарное время работы превышает 24 часа (строка %3)", Выборка.Сотрудник, Формат(Выборка.ДатаГрафика,"ДФ=dd.MM.yy") , Выборка.НомерСтроки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,Ссылка,,,Отказ);
	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти 

#КонецЕсли
